The following repository contains personal implementation of the 'Python-Programming-Funcdation' course I took on Udacity.
This ReadMe file contains personal notes I took as I while I was taking the course. 

** Class variables
- class variables are variables that are shared among instances.
  example in the media.Movie() class, if there is a new variable called valid ratings
  it would not make sens for toy_story to have its own attribute called 

#+begin_src python :session
toy_story.VALID_RATINGS =tuple()
#and for the avatar movie to have an attribute called
avatar.VALID_RATINGS=tuple()
#+end_src

  the valid_ratings set() is a good candidate for a class variable as it is the same ressource among
  all instances.

	- To access a class variable, the class name has to be used.

#+begin_src python :results output export
class Movie(object):
	VALID_RATINGS = ("G", "PG", "PG-13", "R")
	def __init__(self,*args, **kwargs):
		pass
# to access the valid ratings
print(Movie.VALID_RATINGS)

#+end_src

#+RESULTS:
: ('G', 'PG', 'PG-13', 'R')

  Notice that the above code is not bound to any object, but the class itself, because
it is a class method.
  And since *VALID_RATINGS is now a constant* it should be all capitals by convention. 
  I also changed the datastrucutre from set to tuple to make the variable /immuatable/.

*** Built-in class variables.

 |---------------+--------------------------------------------------------------+------------------|
 | Variable name | Description                                                  | Return type      |
 |---------------+--------------------------------------------------------------+------------------|
 | /__doc__/     | displays the documentation written at thestart of the class. | string, None     |
 |---------------+--------------------------------------------------------------+------------------|
 | /__name__/    | Displays the name of the class                               | string           |
 |---------------+--------------------------------------------------------------+------------------|
 | /__base__/    | Displays classes from which this class inherits from         | tuple of classes |
 |---------------+--------------------------------------------------------------+------------------|
 | /__module__/  | Displays the name of the module a.k.a file in which this     | String           |
 |               | module was defined                                           |                  |
 |---------------+--------------------------------------------------------------+------------------|

#+begin_src python :results output export
class Movie(object):
	'''This class provides a way to store movie related information'''
	pass

# displaying the class attributes
class_variables = ('Movie.__name__', 'Movie.__doc__', 'Movie.__base__', 'Movie.__module__')
for attribute in class_variables:
	print(attribute,'\t:',eval(attribute))

#+end_src

#+RESULTS:
: Movie.__name__ 	: Movie
: Movie.__doc__ 	: This class provides a way to store movie related information
: Movie.__base__ 	: <class 'object'>
: Movie.__module__ 	: __main__

